<style  type="text/css">
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Fall 2023, Sections 002
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 2
</span>
</center></i>

# Introduction

This notebook contains HW2. **Both Programming and Nonprogramming tracks should complete this part.** To ensure everything runs as expected, work on this notebook in Jupyter.

Submission instructions:

* You will submit **PDF and ZIP files** for this assignment. Gradescope will have two separate assignments for these.
* For the PDF:
    * The most reliable way to save as PDF is to go to your browser's menu bar and click `File -> Print`. Switch the orientation to landscape mode, and hit save.
    * **MAKE SURE ALL YOUR WORK (CODE AND SCREENSHOTS) IS VISIBLE ON THE PDF. YOU WILL NOT GET CREDIT IF ANYTHING IS CUT OFF.** Reach out for troubleshooting.
* For the ZIP:
    * Zip a folder containing this notebook and any screenshots.
* Further submission instructions may be posted on Edstem.

# Setup

In [156]:
%load_ext sql
%sql mysql+pymysql://root:Jobapplication2022.@localhost
%sql SELECT 1

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
ERROR! Session/line number was not unique in database. History logging moved to new session 383
 * mysql+pymysql://root:***@localhost
1 rows affected.

[(1,)]

In [157]:
import csv
import copy

import pandas as pd
import pymysql

In [158]:
sql_conn = pymysql.connect(
    user="root",
    password="Jobapplication2022.",
    host="localhost",
    port=3306,
    cursorclass=pymysql.cursors.DictCursor,
    autocommit=True)

cur = sql_conn.cursor()
res = cur.execute("SELECT 1")
res = cur.fetchall()
res

[{'1': 1}]

# Written Questions

## W1

Codd's Third Rule states, "Null values (distinct from the empty character string or a string of blank characters and distinct from zero or any other number) are supported in fully relational DBMS for representing missing information and inapplicable information in a systematic way, independent of data type."

Briefly explain the value of this rule and provide two examples.

Answer:

## W2

Codd's 6th rule states, "All views that are theoretically updatable are also updatable by the system."

Using the following table definition, use SQL (```CREATE VIEW```) to define:
1. Two views of the table that are theoretically not possible to update.
2. One view that is theoretically possible to update.

You do not need to execute the create statement. We are focusing on your understanding.


```
create table midterm_students
(
	social_security_no char(9) not null
		primary key,
	last_name varchar(64) null,
	first_name varchar(64) null,
	enrollment_year year null,
	total_credits int null
);
```

Answer:

- [1]: "Average of total credits by yearss": not theoretically updatable for aggregated data.
```
CREATE VIEW not_possible_view1 AS
SELECT
    enrollment_year,
    AVG(total_credits) AS average_credits
FROM midterm_students
GROUP BY enrollment_year;
```
- [2]: "Concating Names from 2 columns": not updatable for calculated column is not a direct column in the base table
```
CREATE VIEW not_possible_view2 AS
SELECT
    social_security_no,
    last_name,
    first_name,
    total_credits,
    CONCAT(last_name, ', ', first_name) AS full_name
FROM midterm_students;
```

- [3]: Views that can be Updated: each row can be updated as it corresponds directly to the base table's columns. 
```
create view possible_view AS
select social_security_no, last_name, first_name
from midterm_students;
```

## W3

In the Columbia University [directory of classes](http://www.columbia.edu/cu/bulletin/uwb/#/cu/bulletin/uwb/subj/COMS/W4111-20233-002), the "Section Key" for this course is ```20233COMS4111W002```.

- Explain why having a column ```section_key varchar(17)``` that holds section key values is non-atomic.
- Give two explanations for why using the section key (non-atomic data) for a column causes problems.

Answer:
- Atomic data is a single, self-containned piec of information, which cannot divided into smaller meaningful components. In  this case section_key ```20233COMS4111W002``` is composed of multiple information like year, course title and section. 
- Such nnon-atomic data can lead to data integrity issue and data querying complexity. For data integrity, errors can occur during data entry and thus decrese the chanve of conrrectnesss of data due to the length. Queryinng complxity can also be the challenge since operations like filtering, sorting and searching requries more convoluted SQL queries and slows down the performance.

## W4

Briefly explain the differences between

- Database stored procedures
- Database functions
- Database triggers

Answer:
- Database stored procedures:
    - DSP is a collection of SQL statements and procedural logic that can be save and reused over and over again. (invoked using the CALL or EXEC statement)
    ```
        ex: CREATE PROCEDURE procedure_name
            AS
            sql_statement
            GO;

            EXEC procedure_name;
    ```
- Database functions:
    - this function can accepts paramaters, performs an action and returns the result of that actions as a value. 
    ```
    CREATE FUNCTION calculateDiscount(price DECIMAL, discountPercent DECIMAL)
    RETURNS DECIMAL
    BEGIN
        RETURN price * (1 - discountPercent);
    END;
    ``` 
- Database triggers:
    - A trigger is a set of instructions that are automatically executed whrn a specific event occurs in the database. 
    ```
    CREATE OR REPLACE TRIGGER audit_employee_changes
    BEFORE INSERT OR UPDATE OR DELETE ON employees
    FOR EACH ROW
    BEGIN
    -- Log the change to an audit table
     INSERT INTO employee_audit (employee_id, action, change_date)
     VALUES (:OLD.employee_id, 'UPDATE', SYSDATE);
END;
    ```

## W5

Consider the `db_book` schema, which we have used in class and previous HWs.

1. Is any entity type in the schema a _weak entity_? If yes, list one of them.
2. In database design, using ```ON DELETE CASCADE``` may not be desired behavior/design. Why is it more likely that ```ON DELETE CASCADE``` is the correct behavior for weak entities when the referenced row is deleted?

Answer:

## W6

Briefly explain the differences between:
1. _Candidate Key_ and _Super Key_
2. _Primary Key_ and _Unique Key_
3. _Natural Key_ and _Surrogate Key_

Answer:
-  1. Difference between candidate key  and super key: Super key is the combination of fields by which the row is uniquely identified and the candidate key is the minimal super key.

    - Candidate Key: A candidate key is a set of one/more attributes (columns) that can uniquely identify each row. It means that no 2 rows in the table will have the same combination of values for the candidate key attributes. 
    - _Super Key_: a set of one or more attibutes that can be used uniquely identify rows in a table. SK can contain NULL values 
- 2. _Primary Key vs Unique Key_: Primary key is a special type of candidate key that is chosen as the main method for uniquely identifying rows in a table. A unique key is a constaint that ensures the values in a set of attributes are unique. However, a table can have multiple unique keys and they can allow NULL balues. 
- 3. Natural key and Surrogate key: Natural keys are based on real-world data attibutes, while surrogate keys are system-generated identifier with no busiiness meaning.

## W7

1. Briefly explain the concept of a _database cursor_.
2. Why is using a cursor helpful for applications processing database information?

Answer:
- a database cursor is a datbase management concept used to retrive and manipulate data within a database. It acts as a pointer or a control struucutre that allows applications to traverse a result set obtrined from a query. 
pros: data navifation: by iterating through the result set row by row, enabling applications to process each record in a controlled and sequential manner.

## W8

Give two reasons for using an associate entity to implement a relationship instead of a foreign key.

Answer:

- When you manage Many-to-Many Relationships,  asociate entity can act as a junction table that contains foregin keys referencing the primary keys of the 2 related entities. This approach allows you to handle commplex relationships and track the many-to-many  associatioins accurately.

## W9

Briefly explain the following data modeling concepts:

- Conceptual model
- Logical model
- Physical model

Answer:
- Conceptual model: provides an overall view of the database structure, without too much relational or implementatioinal details. 

- Logical model: a more more detailed database representation of databse system, supporting information like how data stored, accessed and connected by different keys etc. 
    - Example: In the logical model, you define specific database tables like "Student," "Course," and "Instructor" and their attributes.
    
- Physical model: invovles with technical implementation asepcts of DB. How data is physical indexed, accessed by the system. 
    - details like table storage, filegroups, indexes, and query optimization strategies based on the capabilities and requirements of a specific DBMS, such as Oracle, SQL Server, or MySQL.

## W10

Briefly explain the difference between _data definition language_ and _data manipulation language_.

Answer:
- DDL: defining,  desiging, and managing the structure and schema of a database. Common commands are ```creating, modifying,and deleting```. 

- DML: manipulating, querying, managing the data within a database Common commands are ```selecting updating, deleting```

# DDL

- You have a logical ER diagram below.


- You need to use DDL to define a schema that realizes the model.


- Logical models are not specific enough for direct implementation. This means that:
    - You will have to assign concrete types to columns and choose things like ```GENERATED```, ```DEFAULT```, etc.
    - You have to make assumptions about things like ```NOT NULL```.
    - You may have to make other design and implementation choices. **This means that there is no single correct answer.**
    
    
- In addition to the key constraints, you must also implement the following constraints:
    - `id` values must be an auto-incrementing integer
    - ```email``` must contain an ```@``` and end in ```.edu```
    - `rank` must be one of `Member` or `Admin`
    - ```num_stars``` must be between 1 and 5

| <img src="./book_club_er.png"> |
| :---: |
| __ER Diagram__ |

_Design Decisions, Notes, etc._ Document any assumption or decisions.
- In book table, we chose ```author_id``` as ```author```, which can be used as FK for author table's ```id```. 
    - Same logic applies to the bookclub table's ```book_id```(replace book), review table's ```user_id```,```book_id```, member table's ```user_id, book_club_id```.
- In user's table: 
add user_id as a new column such that we can use it as the foregin key for user_id from member table.

Execute your DDL in the cell below.

In [5]:
from sqlalchemy import create_engine

In [6]:
sql_engine = create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

In [45]:
%%sql

DROP SCHEMA IF EXISTS f23_hw2_er;
CREATE SCHEMA f23_hw2_er;
USE f23_hw2_er;

 * mysql+pymysql://root:***@localhost
6 rows affected.
1 rows affected.
0 rows affected.

[]

In [46]:
%%sql
drop table if exists Author;
## Create the Author table with an auto-increment primary key
CREATE TABLE Author (
    id INT AUTO_INCREMENT,
    first_name VARCHAR(64) NOT NULL,
    last_name VARCHAR(64) NOT NULL,
    biography TEXT,
    PRIMARY KEY (id)
);


# Create the User table
drop table if exists User;
CREATE TABLE User (
    user_id INT AUTO_INCREMENT,
    email VARCHAR(128) NOT NULL,
    first_name VARCHAR(64) NOT NULL,
    last_name VARCHAR(64) NOT NULL,
    
    PRIMARY KEY (user_id),
    CHECK (email LIKE '%@%.edu') # Constraint for email format
);
# Create the Book table
drop table if exists Book;
CREATE TABLE Book (
    id INT AUTO_INCREMENT,
    author_id INT,
    title VARCHAR(128) NOT NULL,
    description TEXT,
    publish_date DATE,
    PRIMARY KEY (id),
    FOREIGN KEY (author_id) REFERENCES Author(id)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [47]:
%%sql

## Create the BookClub table
drop table if exists BookClub;
CREATE TABLE BookClub (
    id INT AUTO_INCREMENT,
    book_id INT,
    start_date DATE,
    end_date DATE,
    PRIMARY KEY (id),
    FOREIGN KEY (book_id) REFERENCES Book(id)
);
drop table if exists Member;
CREATE TABLE Member(
    user_id INT,
    club_id INT,
    rank_type ENUM('Member','Admin') NOT NULL, 
    PRIMARY KEY (user_id, club_id),
    FOREIGN KEY (user_id) REFERENCES User(user_id),
    FOREIGN KEY (club_id) REFERENCES BookClub(id)
);
#Change rank into rank_type (reserved word for speical meaning)


##Create the Review table

drop table if exists Review;
CREATE TABLE Review (
    user_id INT,
    book_id INT,
    num_stars INT CHECK (num_stars BETWEEN 1 AND 5) NOT NULL,
    description TEXT,
    PRIMARY KEY (user_id, book_id),
    FOREIGN KEY (user_id) REFERENCES User(user_id),
    FOREIGN KEY (book_id) REFERENCES Book(id)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

# SQL

## Overview

- The directory contains a file ```people_info.csv```. The columns are
    - ```first_name```
    - ```middle_name```
    - ```last_name```
    - ```email```
    - ```employee_type,``` which can be one of ```Professor```, ```Lecturer```, ```Staff```. The value is empty if the person is a student.
    - ```enrollment_year``` which must be in the range ```2016-2023```. The value is empty if the person is an employee.
    

- If ```enrollment_year``` is not NULL, the person is a ```Student``` and ```employee_type``` must be NULL. If ```employee_type``` is not NULL, then the person is a ```Employee``` and ```enrollment_year``` must be NULL.


- You must implement a [two-table](https://vertabelo.com/blog/inheritance-in-a-relational-database/) solution to the inheritance pattern. This means that your solution will have tables ```student``` and ```employee```, and have a view ```people```.


- **You must demonstrate correct implementation by loading the data, using select statements, attempting insert/update/delete, ...**

In [48]:
%%sql

DROP SCHEMA IF EXISTS f23_hw2;
CREATE SCHEMA f23_hw2;
USE f23_hw2;

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.
0 rows affected.

[]

In [49]:
import pandas as pd
people_info = pd.read_csv("./people_info.csv")

In [69]:
people_info

,first_name,middle_name,last_name,email,employee_type,enrollment_year
0,Sanders,Arline,Breckell,abreckell1x@fotki.com,Professor,NaN
1,Zared,NaN,Fenelon,afenelona@themeforest.net,NaN,2021.0
2,Ethelin,NaN,Fidele,afidele12@google.ru,Lecturer,NaN
3,Bibbye,Annabal,Guesford,aguesfordb@tumblr.com,NaN,2018.0
4,Xenia,Ardella,Kief,akieft@free.fr,Staff,NaN
...,...,...,...,...,...,...
95,Norry,NaN,Rubinchik,trubinchik16@howstuffworks.com,NaN,2016.0
96,Doug,NaN,Medforth,vmedforth1o@homestead.com,Staff,NaN
97,Gerty,NaN,O'Donegan,vodoneganf@clickbank.net,NaN,2020.0
98,Anabelle,Wallas,Quimby,wquimby1c@nba.com,NaN,2022.0
99,Sasha,Win,Ruffli,wruffli2q@wordpress.com,Lecturer,NaN

In [68]:
people_info.sort_values(by="enrollment_year",ascending=False)

,first_name,middle_name,last_name,email,employee_type,enrollment_year
98,Anabelle,Wallas,Quimby,wquimby1c@nba.com,NaN,2022.0
25,Dougy,NaN,Burchett,eburchettd@chicagotribune.com,NaN,2022.0
84,Meridel,Rawley,Willatts,rwillatts1t@si.edu,NaN,2022.0
80,Fredek,Raddie,Goudie,rgoudie5@blogs.com,NaN,2022.0
54,Trix,NaN,Pretswell,jpretswell1h@xrea.com,NaN,2022.0
...,...,...,...,...,...,...
89,Kristin,NaN,Malacrida,smalacrida1w@economist.com,Staff,NaN
90,Yehudi,Sile,McColley,smccolleyq@amazon.com,Staff,NaN
92,Duncan,Shellie,Sillars,ssillars2l@unicef.org,Professor,NaN
96,Doug,NaN,Medforth,vmedforth1o@homestead.com,Staff,NaN
99,Sasha,Win,Ruffli,wruffli2q@wordpress.com,Lecturer,NaN

In [53]:
people_info.shape #(100, 6)
from sqlalchemy import create_engine
sql_engine = create_engine("mysql+pymysql://root:Jobapplication2022.@localhost")

In [55]:
people_info.to_sql("people_info",con=sql_engine, schema='f23_hw2')

In [58]:
%%sql
USE f23_hw2;
describe f23_hw2.people_info;

 * mysql+pymysql://root:***@localhost
0 rows affected.
7 rows affected.

[('index', 'bigint', 'YES', 'MUL', None, ''),
 ('first_name', 'text', 'YES', '', None, ''),
 ('middle_name', 'text', 'YES', '', None, ''),
 ('last_name', 'text', 'YES', '', None, ''),
 ('email', 'text', 'YES', '', None, ''),
 ('employee_type', 'text', 'YES', '', None, ''),
 ('enrollment_year', 'double', 'YES', '', None, '')]

In [73]:
%%sql
use f23_hw2;
drop table if exists students;
drop table if exists employee;
create table students as select * from people_info where enrollment_year is not Null;
create table employee as select * from people_info where employee_type is not Null;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
50 rows affected.
50 rows affected.

[]

In [74]:
%%sql 
select * from employee;

 * mysql+pymysql://root:***@localhost
50 rows affected.

[(0, 'Sanders', 'Arline', 'Breckell', 'abreckell1x@fotki.com', 'Professor', None),
 (2, 'Ethelin', None, 'Fidele', 'afidele12@google.ru', 'Lecturer', None),
 (4, 'Xenia', 'Ardella', 'Kief', 'akieft@free.fr', 'Staff', None),
 (5, 'Cari', 'Andriana', 'Leask', 'aleask1n@devhub.com', 'Lecturer', None),
 (8, 'Lemmy', 'Burr', 'Bradnocke', 'bbradnockek@nifty.com', 'Lecturer', None),
 (10, 'Sibylle', 'Bearnard', 'Lalley', 'blalley2d@rediff.com', 'Lecturer', None),
 (13, 'Lu', 'Cinnamon', 'Flaxman', 'cflaxman1b@cdbaby.com', 'Lecturer', None),
 (19, 'Hobart', 'Dominic', 'Croal', 'dcroalx@purevolume.com', 'Professor', None),
 (20, 'Marylin', 'Darcy', 'Favey', 'dfavey2p@mozilla.com', 'Staff', None),
 (22, 'Ailbert', 'Danie', 'Warmisham', 'dwarmishame@soundcloud.com', 'Staff', None),
 (24, 'Karon', None, 'Bree', 'ebree1z@creativecommons.org', 'Professor', None),
 (26, 'Maybelle', 'Esteban', 'Cella', 'ecella26@mail.ru', 'Staff', None),
 (27, 'Lelah', 'Ellette', 'Fulk', 'efulk1d@discuz.net', 'Staff', None),
 (37, 'Gisela', None, 'Blagden', 'gblagden1q@buzzfeed.com', 'Professor', None),
 (39, 'Niki', 'Gardiner', 'Form', 'gform18@blogger.com', 'Staff', None),
 (40, 'Suki', None, 'Hellyar', 'ghellyar2a@cornell.edu', 'Staff', None),
 (43, 'Carmine', None, 'Tolman', 'gtolmanr@slideshare.net', 'Staff', None),
 (44, 'Wells', None, 'Yousef', 'gyousef2r@spotify.com', 'Professor', None),
 (47, 'Christie', None, 'Siegertsz', 'hsiegertsz21@instagram.com', 'Professor', None),
 (48, 'Doyle', None, 'Aslin', 'jaslin24@redcross.org', 'Lecturer', None),
 (49, 'Robinett', 'Jami', 'Charte', 'jcharte1y@merriam-webster.com', 'Staff', None),
 (50, 'Olwen', None, 'Hedley', 'jhedley1m@disqus.com', 'Staff', None),
 (53, 'Renae', 'Jaquith', 'Plessing', 'jplessing0@samsung.com', 'Staff', None),
 (56, 'Lilllie', None, 'Snodin', 'jsnodin20@princeton.edu', 'Lecturer', None),
 (58, 'Sayers', 'Karon', 'McKnish', 'kmcknishs@reddit.com', 'Lecturer', None),
 (59, 'Electra', 'Krystle', 'Morfell', 'kmorfell2g@istockphoto.com', 'Professor', None),
 (60, 'Matthieu', 'Kalle', 'Slipper', 'kslipper2f@nytimes.com', 'Staff', None),
 (61, 'Nadia', None, 'Trehearn', 'ktrehearn19@tinyurl.com', 'Lecturer', None),
 (62, 'Clim', None, 'Guislin', 'lguislin2o@chicagotribune.com', 'Professor', None),
 (64, 'Holli', None, 'Henstridge', 'lhenstridgeh@sogou.com', 'Lecturer', None),
 (65, 'Meghan', None, 'Kleinschmidt', 'lkleinschmidtl@squarespace.com', 'Lecturer', None),
 (66, 'Genni', None, 'Purbrick', 'lpurbrick25@canalblog.com', 'Professor', None),
 (67, 'Bonny', None, 'Scheffel', 'lscheffel7@taobao.com', 'Professor', None),
 (68, 'Mendie', None, 'Tennick', 'ltennick3@aboutads.info', 'Staff', None),
 (70, 'Karole', None, 'Inkin', 'minkinc@google.de', 'Staff', None),
 (72, 'Kahaleel', 'Meg', 'Penzer', 'mpenzer14@dailymail.co.uk', 'Professor', None),
 (74, 'Darrin', 'Mario', 'Wynrahame', 'mwynrahamem@admin.ch', 'Professor', None),
 (75, 'Carey', 'Maudie', 'Wyrall', 'mwyrallj@scientificamerican.com', 'Staff', None),
 (76, 'Jacky', 'Nydia', 'Bolles', 'nbolles23@ucoz.ru', 'Staff', None),
 (77, 'Francene', None, 'MacNeely', 'nmacneely22@cpanel.net', 'Lecturer', None),
 (81, 'Bamby', 'Rubetta', 'Mabbs', 'rmabbs4@xing.com', 'Lecturer', None),
 (82, 'Ari', 'Rheta', 'Sellek', 'rsellek6@oakley.com', 'Lecturer', None),
 (86, 'Bettina', 'Sonya', 'Higgonet', 'shiggonet2b@163.com', 'Lecturer', None),
 (87, 'Jany', 'Sherry', 'Johl', 'sjohlg@soundcloud.com', 'Professor', None),
 (88, 'Pattie', None, 'Lyles', 'slyles1j@amazon.de', 'Staff', None),
 (89, 'Kristin', None, 'Malacrida', 'smalacrida1w@economist.com', 'Staff', None),
 (90, 'Yehudi', 'Sile', 'McColley', 'smccolleyq@amazon.com', 'Staff', None),
 (92, 'Duncan', 'Shellie', 'Sillars', 'ssillars2l@unicef.org', 'Professor', None),
 (96, 'Doug', None, 'Medforth', 'vmedforth1o@homestead.com', 'Staff', None),
 (99, 'Sasha', 'Win', 'Ruffli', 'wruffli2q@wordpress.com', 'Lecturer', None)]

In [76]:
%%sql 
select * from students limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 'Zared', None, 'Fenelon', 'afenelona@themeforest.net', None, 2021.0),
 (3, 'Bibbye', 'Annabal', 'Guesford', 'aguesfordb@tumblr.com', None, 2018.0),
 (6, 'Duffy', 'Auberon', 'Pounder', 'apounder2h@reuters.com', None, 2017.0),
 (7, 'Base', None, 'Baybutt', 'bbaybutty@tmall.com', None, 2021.0),
 (9, 'Jenine', 'Berry', 'Habberjam', 'bhabberjam2k@examiner.com', None, 2021.0),
 (11, 'Reece', 'Corbett', 'Caps', 'ccapsz@telegraph.co.uk', None, 2019.0),
 (12, 'Barry', 'Cullin', 'Elias', 'celias1k@scribd.com', None, 2018.0),
 (14, 'Kerwin', 'Conrade', 'Foort', 'cfoortw@vinaora.com', None, 2020.0),
 (15, 'Brigida', 'Cameron', 'Maclean', 'cmaclean13@mac.com', None, 2019.0),
 (16, 'Woodrow', 'Camile', 'Moughtin', 'cmoughtin17@illinois.edu', None, 2022.0)]

In [92]:
%%sql
drop view if exists people;
CREATE VIEW people AS
SELECT *
FROM students
UNION ALL
SELECT *
FROM employee
order by enrollment_year desc;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [96]:
%%sql
select * from people order by enrollment_year desc limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(16, 'Woodrow', 'Camile', 'Moughtin', 'cmoughtin17@illinois.edu', None, 2022.0),
 (84, 'Meridel', 'Rawley', 'Willatts', 'rwillatts1t@si.edu', None, 2022.0),
 (80, 'Fredek', 'Raddie', 'Goudie', 'rgoudie5@blogs.com', None, 2022.0),
 (54, 'Trix', None, 'Pretswell', 'jpretswell1h@xrea.com', None, 2022.0),
 (42, 'Sada', None, 'Stidson', 'gstidsonp@ebay.com', None, 2022.0),
 (98, 'Anabelle', 'Wallas', 'Quimby', 'wquimby1c@nba.com', None, 2022.0),
 (34, 'Dyna', 'Felic', 'Rozenzweig', 'frozenzweig2i@rambler.ru', None, 2022.0),
 (25, 'Dougy', None, 'Burchett', 'eburchettd@chicagotribune.com', None, 2022.0),
 (21, 'Kermit', None, 'Glanders', 'dglanders15@booking.com', None, 2022.0),
 (18, 'Quent', None, 'Threadgall', 'cthreadgall1v@booking.com', None, 2022.0)]

In [107]:
%%sql

describe f23_hw2.students;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('index', 'bigint', 'YES', '', None, ''),
 ('first_name', 'text', 'YES', '', None, ''),
 ('middle_name', 'text', 'YES', '', None, ''),
 ('last_name', 'text', 'YES', '', None, ''),
 ('email', 'text', 'YES', '', None, ''),
 ('employee_type', 'text', 'YES', '', None, ''),
 ('enrollment_year', 'double', 'YES', '', None, '')]

## Tables and View

- You must implement the two tables and view, including reasonable data types and constraints. **This must include an additional column ```uni``` that we explain below.** You may add additional columns and triggers if that helps.
    1. `uni` is the primary key.
    2. ```employee_type``` must be one of ```Professor```, ```Lecturer```, ```Staff```.
    3. ```enrollment_year``` must be in the range ```2016-2023``` inclusive.
    4. Only ```middle_name``` can be null.
    5. ```email``` must be unique over both ```student``` and ```employee```. Note that this constraint should be checked when inserting new rows _and_ updating existing rows.

In [133]:
%%sql
#-- Add the new column "uni" as the primary key to both tables
ALTER TABLE students
ADD COLUMN uni VARCHAR(10);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [ ]:
%%sql

#  Add a constraint for "employee_type" in the employee table
ALTER TABLE employee ADD CONSTRAINT chk_employee_type
CHECK (employee_type IN ('Professor', 'Lecturer', 'Staff'));

# Add a constraint for "enrollment_year" in the student table
ALTER TABLE students ADD CONSTRAINT chk_enrollment_year
CHECK (enrollment_year BETWEEN 2016 AND 2023);

# Allow "middle_name" to be NULL in both tables
ALTER TABLE students MODIFY COLUMN middle_name TEXT NULL;
ALTER TABLE employee MODIFY COLUMN middle_name TEXT NULL;

 * mysql+pymysql://root:***@localhost
(pymysql.err.IntegrityError) (1062, "Duplicate entry '0' for key 'students.PRIMARY'")
[SQL: -- Add the new column "uni" as the primary key to both tables
ALTER TABLE students ADD COLUMN uni INTEGER PRIMARY KEY;]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [116]:
%%sql
# Create a trigger to check email uniqueness when inserting into the student table
DROP TRIGGER check_email_uniqueness_student;
DROP TRIGGER check_email_uniqueness_employee;

CREATE TRIGGER check_email_uniqueness_student
BEFORE INSERT ON students
FOR EACH ROW
BEGIN
  IF EXISTS (
    SELECT 1 FROM employee WHERE email = NEW.email
  ) THEN
    SIGNAL SQLSTATE '45000'
    SET MESSAGE_TEXT = 'Email address already exists in the employee table';
  END IF;
END;


# Create a trigger to check email uniqueness when inserting into the employee table
CREATE TRIGGER check_email_uniqueness_employee
BEFORE INSERT ON employee
FOR EACH ROW
BEGIN
  IF EXISTS (
    SELECT 1 FROM student WHERE email = NEW.email
  ) THEN
    SIGNAL SQLSTATE '45000'
    SET MESSAGE_TEXT = 'Email address already exists in the student table';
  END IF;
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

## UNI

- `uni`:
    1. Must be of the form `fml####`, where `f` is the first letter (lowercased) of the first name, `m` is the first letter of the middle name (if not NULL), `l` is the first letter of the last name, and `#` is a number.
    2. For any combination of letters, the numbers following the letters must start at 1 and increase. That is, `dff0001`, `ab0001`, `dff0002`, `cd0001`, `cad0001`, `cd0002`, ...
    3. You must implement a function to generate the ```uni```.
    4. You must implement triggers on the relevant tables to automatically set the ```uni``` during an insert.
    5. You must implement triggers that adjust the `uni` if a person's initials change during an update.
    6. You must implement logic that prevent inserts from directly setting the `uni` and updates from directly changing the ```uni```.

In [126]:
%%sql
CREATE FUNCTION generate_uni(first_name VARCHAR(255), middle_name VARCHAR(255), last_name VARCHAR(255)) RETURNS VARCHAR(255)
DETERMINISTIC
BEGIN
    DECLARE initials VARCHAR(10);
    DECLARE uni_number INT;
    SET initials = LOWER(SUBSTRING(first_name, 1, 1));
    IF middle_name IS NOT NULL THEN
        SET initials = CONCAT(initials, SUBSTRING(middle_name, 1, 1));
    END IF;
    SET initials = CONCAT(initials, SUBSTRING(last_name, 1, 1));
    
    -- Find the next available uni number for the given initials
    SELECT MAX(CONVERT(SUBSTRING(uni, LENGTH(uni) - 3), SIGNED)) + 1
    INTO uni_number
    FROM students
    WHERE SUBSTRING(uni, 1, LENGTH(uni) - 4) = initials;

    -- If no matching records found, set uni_number to 1
    IF uni_number IS NULL THEN
        SET uni_number = 1;
    END IF;

    -- Format the uni with leading zeros
    SET initials = LPAD(uni_number, 4, '0');
    RETURN CONCAT(initials, LPAD(uni_number, 4, '0'));
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [134]:
%%sql
-- Trigger to set UNI during insert
CREATE TRIGGER set_uni_on_insert_students
BEFORE INSERT ON students
FOR EACH ROW
BEGIN
    SET NEW.uni = generate_uni(NEW.first_name, NEW.middle_name, NEW.last_name);
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [137]:
%%sql


##-- Check constraint to prevent inserting a specific UNI
ALTER TABLE students
ADD CONSTRAINT chk_insert_uni CHECK (NEW.uni IS NULL);

##-- Check constraint to prevent updating UNI directly
ALTER TABLE students
ADD CONSTRAINT chk_update_uni CHECK (NEW.uni = OLD.uni);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

## Procedures

- You must implement four stored procedures. The implementations of the four procedures are almost identical.
    1. The procedures are:
        1. `create_student(first_name, middle_name, last_name, email, enrollment_year, uni)`
        2. `create_employee(first_name, middle_name, last_name, email, employee_type, uni)`
        3. `update_student(uni, first_name, middle_name, last_name, email, enrollment_year)`
        4. `update_employee(uni, first_name, middle_name, last_name, email, employee_type)`
    2. For updates, the procedures ignore input parameters that are NULL and only apply the non-NULL values. The procedures do not update the ```uni```.
    3. The create procedures return the ```uni``` as an out value.

In [144]:
%%sql
drop procedure create_student;
CREATE PROCEDURE create_student(
  IN first_name VARCHAR(64),
  IN middle_name VARCHAR(64),
  IN last_name VARCHAR(64),
  IN email VARCHAR(128),
  IN enrollment_year YEAR,
  OUT uni VARCHAR(10)
)
BEGIN
  -- Generate the UNI
  SET uni = generate_uni(first_name, middle_name, last_name);

 # Insert the students
  INSERT INTO students (uni, first_name, middle_name, last_name, email, enrollment_year)
  VALUES ( first_name, middle_name, last_name, email, enrollment_year,uni);
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [150]:
%%sql
#drop procedure create_employee;
#create_employee
CREATE PROCEDURE create_employee(
  IN first_name VARCHAR(64),
  IN middle_name VARCHAR(64),
  IN last_name VARCHAR(64),
  IN email VARCHAR(128),
  IN employee_type ENUM('Professor', 'Lecturer', 'Staff'),
  OUT uni VARCHAR(10)
)
BEGIN
  -- Generate the UNI
  SET uni = generate_uni(first_name, middle_name,last_name);

  -- Insert the employee
  INSERT INTO employee (uni, first_name, middle_name, last_name, email, employee_type)
  VALUES (first_name, middle_name, last_name, email, employee_type, uni);
END;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [151]:
%%sql
CREATE PROCEDURE update_student(
  IN existing_uni VARCHAR(10),
  IN first_name VARCHAR(64),
  IN middle_name VARCHAR(64),
  IN last_name VARCHAR(64),
  IN email VARCHAR(128),
  IN enrollment_year YEAR
)
BEGIN
# Update the student ignoring NULL values
  UPDATE students
  SET
    first_name = COALESCE(first_name, first_name),
    middle_name = COALESCE(middle_name, middle_name),
    last_name = COALESCE(last_name, last_name),
    email = COALESCE(email, email),
    enrollment_year = COALESCE(enrollment_year, enrollment_year)
  WHERE uni = existing_uni;
END;

CREATE PROCEDURE update_employee(
  IN existing_uni VARCHAR(10),
  IN first_name VARCHAR(64),
  IN middle_name VARCHAR(64),
  IN last_name VARCHAR(64),
  IN email VARCHAR(128),
  IN employee_type ENUM('Professor', 'Lecturer', 'Staff')
)
BEGIN
# Update the employee ignoring NULL values
  UPDATE employee
  SET
    first_name = COALESCE(first_name, first_name),
    middle_name = COALESCE(middle_name, middle_name),
    last_name = COALESCE(last_name, last_name),
    email = COALESCE(email, email),
    employee_type = COALESCE(employee_type, employee_type)
  WHERE uni = existing_uni;
END;

 * mysql+pymysql://root:***@localhost
(pymysql.err.OperationalError) (1304, 'PROCEDURE update_student already exists')
[SQL: CREATE PROCEDURE update_student(
  IN existing_uni VARCHAR(10),
  IN first_name VARCHAR(64),
  IN middle_name VARCHAR(64),
  IN last_name VARCHAR(64),
  IN email VARCHAR(128),
  IN enrollment_year YEAR
)
BEGIN
# Update the student ignoring NULL values
  UPDATE students
  SET
    first_name = COALESCE(first_name, first_name),
    middle_name = COALESCE(middle_name, middle_name),
    last_name = COALESCE(last_name, last_name),
    email = COALESCE(email, email),
    enrollment_year = COALESCE(enrollment_year, enrollment_year)
  WHERE uni = existing_uni;
END;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## Security

- You must create a new user `general_user` and use security to allow it to perform only `SELECT` and `EXECUTE` operations (i.e., no ```INSERT```, ```DELETE```, and ```UPDATE``` operations).

In [ ]:
%%sql

## Data Insertion

In [138]:
%%sql

# The following assumes that you have created everything properly

DELETE FROM f23_hw2.students;
DELETE FROM f23_hw2.employee;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [139]:
people_info = []
with open("people_info.csv", "r") as in_file:
    d_rdr = csv.DictReader(in_file)
    for r in d_rdr:
        people_info.append(dict(r))

people_info_df = pd.DataFrame(people_info)
people_info_df

,first_name,middle_name,last_name,email,employee_type,enrollment_year
0,Sanders,Arline,Breckell,abreckell1x@fotki.com,Professor,
1,Zared,,Fenelon,afenelona@themeforest.net,,2021
2,Ethelin,,Fidele,afidele12@google.ru,Lecturer,
3,Bibbye,Annabal,Guesford,aguesfordb@tumblr.com,,2018
4,Xenia,Ardella,Kief,akieft@free.fr,Staff,
...,...,...,...,...,...,...
95,Norry,,Rubinchik,trubinchik16@howstuffworks.com,,2016
96,Doug,,Medforth,vmedforth1o@homestead.com,Staff,
97,Gerty,,O'Donegan,vodoneganf@clickbank.net,,2020
98,Anabelle,Wallas,Quimby,wquimby1c@nba.com,,2022
99,Sasha,Win,Ruffli,wruffli2q@wordpress.com,Lecturer,

In [154]:
# If you have defined your procedures, functions, tables, and constraints correctly, you can use the function below
# to load your data.

def add_person(p):
    """
    p is a dictionary containing the column values for either a student or an employee.
    """
    
    cur = sql_conn.cursor()
    
    # This function changes the data, converting '' to None.
    # So, we make a copy and change the copy.
    p_dict = copy.copy(p)
    for k,v in p_dict.items():
        if v == '':
            p_dict[k] = None
    
    # Is the person a student?
    #
    if p_dict['employee_type'] is None:
        
        # This provides a hint for what your stored procedure will look like.
        res = cur.callproc("f23_hw2.create_student",
                           # The following are in parameters
                          (p_dict['first_name'],
                          p_dict['middle_name'],
                          p_dict['last_name'],
                           p_dict['email'],
                          p_dict['enrollment_year'],
                           # The following are out parameters for uni.
                          None))
        
        # After the procedure executes, the following query will select the out values.
        res = cur.execute("""SELECT @_f23_hw2.create_student_5""")
        result = cur.fetchall()
    
    # The following does the same for employee.
    elif p_dict['enrollment_year'] is None:
        res = cur.callproc("f23_hw2.create_employee",
                          (p_dict['first_name'],
                          p_dict['middle_name'],
                          p_dict['last_name'],
                           p_dict['email'],
                          p_dict['employee_type'],
                          None))
        res = cur.execute("""SELECT @_f23_hw2.create_employee_5""")
        result = cur.fetchall()
    else:
        print("Something went wrong")
        result = None
    
    sql_conn.commit()
    cur.close()
    return result

In [155]:
for p in people_info:
    add_person(p)

OperationalError: (1054, "Unknown column 'uni' in 'field list'")

In [142]:
# Test that we loaded people
%sql SELECT * FROM people

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [ ]:
# Test that we loaded students
%sql SELECT * FROM student

In [ ]:
# Test that we loaded employees
%sql SELECT * FROM employee

## Testing

Add your tests below. You should test

1. Successful execution of each procedure.
2. Execution of update procedures showing that your constraints prevent incorrect data entry and enforce the defined semantics and behavior.
3. ```general_user``` can query the data and call the procedures, but cannot perform ```INSERT```, ```UPDATE```, or ```DELETE```.